In [73]:
import sqlite3
sqlite_db = 'test_db.sqlite'
conn = sqlite3.connect(sqlite_db)
c = conn.cursor()

In [74]:
# c.execute('CREATE TABLE houses (field1 INTEGER PRIMARY KEY, sqft INTEGER, bdrms INTEGER, age INTEGER, price INTEGER);')

#c.execute("select * FROM houses",con=conn)
#sql.read_sql('select * from houses limit 10', con=conn)
c.execute("SELECT * FROM houses WHERE  bdrms = 4 ").fetchall()

[(2, 2390, 4, 34, 319000),
 (9, 3000, 4, 75, 539900),
 (10, 1985, 4, 61, 299900),
 (15, 1940, 4, 7, 239999),
 (20, 2300, 4, 77, 449900),
 (23, 2609, 4, 5, 499998),
 (24, 3031, 4, 21, 599000),
 (28, 1962, 4, 53, 259900),
 (37, 2040, 4, 75, 314900),
 (39, 1811, 4, 24, 285900),
 (42, 2132, 4, 28, 345000),
 (43, 4215, 4, 66, 549000),
 (44, 2162, 4, 43, 287000),
 (47, 2567, 4, 57, 314000),
 (50, 1852, 4, 64, 299900)]

In [75]:
conn.commit()

In [76]:
last_sale = (None, 4000, 5, 22, 619000) # for auto increment in primary key
c.execute('INSERT INTO houses VALUES (?,?,?,?,?)',last_sale)

In [77]:
recent_sales = [
  (None, 2390, 4, 34, 319000),
  (None, 1870, 3, 14, 289000),     # array of touples
  (None, 1505, 3, 90, 269000),
]

c.executemany('INSERT INTO houses VALUES (?, ?, ?, ?, ?)', recent_sales) # executemany insert array of 
#record one at a time

In [78]:
from numpy import genfromtxt

# import into nparray of ints, then convert to list of lists
data = (genfromtxt('../../assets/datasets/housing-data.csv', dtype='i8',
                    delimiter=',', skip_header=1)).tolist() # load file and convert into list 

# append a None value to beginning of each sub-list
for d in data:
    d.insert(0, None) # insert the none for each row in data for the primary key.
print(data)

[[None, 2104, 3, 70, 399900], [None, 1600, 3, 28, 329900], [None, 2400, 3, 44, 369000], [None, 1416, 2, 49, 232000], [None, 3000, 4, 75, 539900], [None, 1985, 4, 61, 299900], [None, 1534, 3, 12, 314900], [None, 1427, 3, 57, 198999], [None, 1380, 3, 14, 212000], [None, 1494, 3, 15, 242500], [None, 1940, 4, 7, 239999], [None, 2000, 3, 27, 347000], [None, 1890, 3, 45, 329999], [None, 4478, 5, 49, 699900], [None, 1268, 3, 58, 259900], [None, 2300, 4, 77, 449900], [None, 1320, 2, 62, 299900], [None, 1236, 3, 78, 199900], [None, 2609, 4, 5, 499998], [None, 3031, 4, 21, 599000], [None, 1767, 3, 44, 252900], [None, 1888, 2, 79, 255000], [None, 1604, 3, 13, 242900], [None, 1962, 4, 53, 259900], [None, 3890, 3, 36, 573900], [None, 1100, 3, 60, 249900], [None, 1458, 3, 29, 464500], [None, 2526, 3, 13, 469000], [None, 2200, 3, 28, 475000], [None, 2637, 3, 25, 299900], [None, 1839, 2, 40, 349900], [None, 1000, 1, 5, 169900], [None, 2040, 4, 75, 314900], [None, 3137, 3, 67, 579900], [None, 1811, 4, 24, 285900], [None, 1437, 3, 50, 249900], [None, 1239, 3, 22, 229900], [None, 2132, 4, 28, 345000], [None, 4215, 4, 66, 549000], [None, 2162, 4, 43, 287000], [None, 1664, 2, 40, 368500], [None, 2238, 3, 37, 329900], [None, 2567, 4, 57, 314000], [None, 1200, 3, 76, 299000], [None, 852, 2, 70, 179900], [None, 1852, 4, 64, 299900], [None, 1203, 3, 11, 239500]]

In [79]:
data[0:3]

[[None, 2104, 3, 70, 399900],
 [None, 1600, 3, 28, 329900],
 [None, 2400, 3, 44, 369000]]

In [80]:
for d in data:
    c.execute('INSERT INTO houses VALUES (?, ?, ?, ?, ?)', d)

conn.commit()

In [81]:
c.execute("SELECT * FROM houses WHERE  bdrms = 4 ").fetchall()

[(2, 2390, 4, 34, 319000),
 (9, 3000, 4, 75, 539900),
 (10, 1985, 4, 61, 299900),
 (15, 1940, 4, 7, 239999),
 (20, 2300, 4, 77, 449900),
 (23, 2609, 4, 5, 499998),
 (24, 3031, 4, 21, 599000),
 (28, 1962, 4, 53, 259900),
 (37, 2040, 4, 75, 314900),
 (39, 1811, 4, 24, 285900),
 (42, 2132, 4, 28, 345000),
 (43, 4215, 4, 66, 549000),
 (44, 2162, 4, 43, 287000),
 (47, 2567, 4, 57, 314000),
 (50, 1852, 4, 64, 299900),
 (53, 2390, 4, 34, 319000),
 (60, 3000, 4, 75, 539900),
 (61, 1985, 4, 61, 299900),
 (66, 1940, 4, 7, 239999),
 (71, 2300, 4, 77, 449900),
 (74, 2609, 4, 5, 499998),
 (75, 3031, 4, 21, 599000),
 (79, 1962, 4, 53, 259900),
 (88, 2040, 4, 75, 314900),
 (90, 1811, 4, 24, 285900),
 (93, 2132, 4, 28, 345000),
 (94, 4215, 4, 66, 549000),
 (95, 2162, 4, 43, 287000),
 (98, 2567, 4, 57, 314000),
 (101, 1852, 4, 64, 299900)]

In [82]:
#data

In [83]:
results = c.execute("SELECT * FROM houses WHERE bdrms = 4")
results.fetchall()

[(2, 2390, 4, 34, 319000),
 (9, 3000, 4, 75, 539900),
 (10, 1985, 4, 61, 299900),
 (15, 1940, 4, 7, 239999),
 (20, 2300, 4, 77, 449900),
 (23, 2609, 4, 5, 499998),
 (24, 3031, 4, 21, 599000),
 (28, 1962, 4, 53, 259900),
 (37, 2040, 4, 75, 314900),
 (39, 1811, 4, 24, 285900),
 (42, 2132, 4, 28, 345000),
 (43, 4215, 4, 66, 549000),
 (44, 2162, 4, 43, 287000),
 (47, 2567, 4, 57, 314000),
 (50, 1852, 4, 64, 299900),
 (53, 2390, 4, 34, 319000),
 (60, 3000, 4, 75, 539900),
 (61, 1985, 4, 61, 299900),
 (66, 1940, 4, 7, 239999),
 (71, 2300, 4, 77, 449900),
 (74, 2609, 4, 5, 499998),
 (75, 3031, 4, 21, 599000),
 (79, 1962, 4, 53, 259900),
 (88, 2040, 4, 75, 314900),
 (90, 1811, 4, 24, 285900),
 (93, 2132, 4, 28, 345000),
 (94, 4215, 4, 66, 549000),
 (95, 2162, 4, 43, 287000),
 (98, 2567, 4, 57, 314000),
 (101, 1852, 4, 64, 299900)]

In [84]:
import pandas as pd
from pandas.io import sql

In [85]:
import pandas as pd

data = pd.read_csv('../../assets/datasets/housing-data.csv', low_memory=False)
data.head()

   sqft  bdrms  age   price
0  2104      3   70  399900
1  1600      3   28  329900
2  2400      3   44  369000
3  1416      2   49  232000
4  3000      4   75  539900

In [86]:
data.to_sql('houses_pandas',
            con=conn,
            if_exists='replace',
            index=False)

In [87]:
c.execute('select * from houses_pandas limit 10').fetchall()

[(2104, 3, 70, 399900),
 (1600, 3, 28, 329900),
 (2400, 3, 44, 369000),
 (1416, 2, 49, 232000),
 (3000, 4, 75, 539900),
 (1985, 4, 61, 299900),
 (1534, 3, 12, 314900),
 (1427, 3, 57, 198999),
 (1380, 3, 14, 212000),
 (1494, 3, 15, 242500)]

In [88]:
#sql.read_sql('SELECT sqft,bdrms FROM houses_pandas',con=conn)

#SELECT sqft, bdrms FROM houses_pandas;

In [89]:
sql.read_sql('SELECT  sqft, bdrms, age, price FROM houses_pandas WHERE bdrms = 2 and price < 250000',con=conn)

   sqft  bdrms  age   price
0  1416      2   49  232000
1   852      2   70  179900

In [90]:
# from sqlalchemy import create_engine
# import pandas as pd
# connect_param = 'postgresql://dsi_student:gastudents@dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com:5432/northwind'
# engine = create_engine(connect_param)
# pd.read_sql("SELECT * FROM pg_catalog.pg_tables WHERE schemaname='public'", con=engine)

In [96]:
url: dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com
port: 5432
database: dsi
user: dsi_student
password: gastudent

SyntaxError: invalid syntax (<ipython-input-96-49bbb421f39f>, line 1)

In [95]:
from sqlalchemy import create_engine
import pandas as pd
connect_param = 'postgresql://dsi_student:gastudents@dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com:5432/northwind'
engine = create_engine(connect_param)
pd.read_sql("SELECT * FROM pg_catalog.pg_tables WHERE schemaname='public'", con=engine)

,schemaname,tablename,tableowner,tablespace,hasindexes,hasrules,hastriggers
0,public,categories,dsi,None,True,False,False
1,public,full_order_table5,dsi_student,None,False,False,False
2,public,fo,dsi_student,None,False,False,False
3,public,table_join,dsi_student,None,False,False,False
4,public,full_order,dsi_student,None,False,False,False
5,public,customercustomerdemo,dsi,None,True,False,False
6,public,customerdemographics,dsi,None,True,False,False
7,public,customers,dsi,None,True,False,False
8,public,employees,dsi,None,True,False,False
9,public,employeeterritories,dsi,None,True,False,False
10,public,order_details,dsi,None,True,False,False
11,public,orders,dsi,None,True,False,False
12,public,products,dsi,None,True,False,False
13,public,region,dsi,None,True,False,False
14,public,shippers,dsi,None,True,False,False
15,public,shippers_tmp,dsi,None,True,False,False
16,public,suppliers,dsi,None,True,False,False
17,public,territories,dsi,None,True,False,False
18,public,usstates,dsi,None,False,False,False
19,public,table1,dsi_student,None,False,False,False
20,public,movies,dsi_student,None,True,False,False
21,public,ratings,dsi_student,None,True,False,False
22,public,categoriesmerged,dsi_student,None,True,False,False
23,public,order_table,dsi_student,None,False,False,False
24,public,full_ord,dsi_student,None,False,False,False
25,public,new_table,dsi_student,None,False,False,False
26,public,full_order_table,dsi_student,None,False,False,False
27,public,full_order_table2,dsi_student,None,False,False,False
28,public,full_order_table3,dsi_student,None,False,False,False
29,public,full_order_table4,dsi_student,None,False,False,False
30,public,temp_table,dsi_student,None,False,False,False
31,public,full_orders_,dsi_student,None,False,False,False
32,public,fullorders_,dsi_student,None,False,False,False
33,public,fullorders__,dsi_student,None,False,False,False
34,public,fullorders,dsi_student,None,False,False,False
35,public,descriptions,dsi_student,None,False,False,False
36,public,price,dsi_student,None,False,False,False
37,public,descriptions1,dsi_student,None,False,False,False
38,public,empterid,dsi_student,None,False,False,False
39,public,final,dsi_student,None,False,False,False
40,public,final2,dsi_student,None,False,False,False
41,public,final3,dsi_student,None,False,False,False
42,public,final4,dsi_student,None,False,False,False
43,public,price2,dsi_student,None,False,False,False
44,public,descriptions2,dsi_student,None,False,False,False
45,public,empterid2,dsi_student,None,False,False,False
46,public,final5,dsi_student,None,False,False,False
47,public,my_table,dsi_student,None,False,False,False
48,public,newregion,dsi_student,None,False,False,False
49,public,updatdregion,dsi_student,None,False,False,False
50,public,updatedregion,dsi_student,None,False,False,False
51,public,updatedregion1,dsi_student,None,False,False,False

In [ ]:
# 1. What's the average price per room for 1 bedroom apartments?
# 1. What's the average price per room for 2 bedrooms apartments?
# 1. What's the most frequent apartment size (in terms of bedrooms)?
# 1. How many are there of that apartment kind?
# 1. What fraction of the total number are of that kind?
# 1. How old is the oldest 3 bedrooms apartment?
# 1. How old is the youngest apartment?
# 1. What's the average age for the whole dataset?
# 1. What's the average age for each bedroom size?

In [45]:
sql.read_sql('select * from houses_pandas limit 10', con=conn)

   sqft  bdrms  age   price
0  2104      3   70  399900
1  1600      3   28  329900
2  2400      3   44  369000
3  1416      2   49  232000
4  3000      4   75  539900
5  1985      4   61  299900
6  1534      3   12  314900
7  1427      3   57  198999
8  1380      3   14  212000
9  1494      3   15  242500

In [50]:
sql.read_sql("select bdrms, avg(price) from houses_pandas where bdrms == 1",con = conn)

   bdrms  avg(price)
0      1    169900.0

In [52]:
sql.read_sql("select bdrms,avg(price) from houses_pandas where bdrms == 2",con = conn)

   bdrms     avg(price)
0      2  280866.666667

In [54]:
sql.read_sql("select bdrms, avg(price) from houses_pandas group by bdrms",con = conn)# group by

   bdrms     avg(price)
0      1  169900.000000
1      2  280866.666667
2      3  326403.920000
3      4  377449.785714
4      5  699900.000000

In [61]:
p = sql.read_sql("select bdrms,count(bdrms) from houses_pandas group by bdrms order by count(bdrms) desc  ",con = conn)

In [62]:
# 3 bedrooms and count is 25
p

   bdrms  count(bdrms)
0      3            25
1      4            14
2      2             6
3      1             1
4      5             1

In [60]:
sql.read_sql("select bdrms,age from houses_pandas where bdrms = 3 order by age desc",con = conn)

    bdrms  age
0       3   78
1       3   76
2       3   70
3       3   67
4       3   60
5       3   58
6       3   57
7       3   50
8       3   45
9       3   44
10      3   44
11      3   37
12      3   36
13      3   29
14      3   28
15      3   28
16      3   27
17      3   25
18      3   22
19      3   15
20      3   14
21      3   13
22      3   13
23      3   12
24      3   11

In [ ]:
#youngests is 11 and oldest is 78

In [63]:
sql.read_sql("select avg(age) from houses_pandas",con =conn)

    avg(age)
0  42.744681

In [71]:
s = sql.read_sql("select bdrms,avg(age) from houses_pandas group by bdrms",con =conn)
type(s)

pandas.core.frame.DataFrame